esp-cpp/espp/components/ota/example/sdkconfig.defaults
# This example uses the native USB-OTG peripheral (for the USB vendor / WebUSB
# OTA transport), which is only available on the ESP32-S3 (also S2 / P4) -- NOT
# the classic ESP32. Pin the target here so a bare `idf.py build` (without an
# explicit `set-target`) does not fall back to esp32 and fail to compile the
# USB device.
CONFIG_IDF_TARGET="esp32s3"

# Common ESP-related
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Put the log console on UART0, NOT the USB-Serial-JTAG peripheral. This example
# hands the native USB-OTG port to TinyUSB for the vendor / WebUSB OTA interface,
# and on the ESP32-S3 the USB-Serial-JTAG controller and the USB-OTG controller
# share the SAME internal USB PHY / physical port (GPIO19/20). Running the console
# on USB-Serial-JTAG therefore contends with the OTA USB interface for that one
# port and makes the device reboot-loop at boot. UART0 is a fully independent
# peripheral, so the console always has a place to go once TinyUSB takes over the
# USB port. (Connect a UART/USB-UART adapter to UART0 for `idf.py monitor`.)
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# Keep USB-Serial-JTAG as the SECONDARY console so early-boot / bootloader logs are
# still visible on the native USB port BEFORE the app brings up TinyUSB. Once the
# app initializes TinyUSB (which takes that USB PHY for the OTA vendor + a CDC
# interface), it reroutes the console to the USB-CDC interface, so a single native
# USB cable carries logs the whole time (JTAG at boot -> CDC after). The primary
# console stays on UART0 as a safe fallback that TinyUSB never touches.
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# Enable the TinyUSB vendor-specific class (THE key enablement for the vendor /
# WebUSB OTA interface). esp_tinyusb gates CFG_TUD_VENDOR behind
# CONFIG_TINYUSB_VENDOR_COUNT; setting it > 0 compiles in the vendor class
# driver so espp::UsbDevice's vendor function (bInterfaceClass 0xFF + WebUSB)
# works.
CONFIG_TINYUSB_VENDOR_COUNT=1

# The example itself only USES the vendor function, but the usb_device
# component's sources reference the TinyUSB CDC + HID class driver APIs, which
# esp_tinyusb gates behind these options -- keep them enabled (minimal counts)
# so the component compiles; no CDC / HID interface is instantiated here.
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_HID_COUNT=1

# OTA needs two app slots; use a custom factory-less partition table (otadata +
# ota_0 + ota_1) on a 4MB flash so each slot can hold this wifi+usb app.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y

# Enable app rollback: a freshly-installed OTA image boots PENDING_VERIFY and is
# rolled back on the next reset unless confirmed. This example demonstrates
# HOST-driven confirmation: the app does NOT mark itself valid — the host does,
# over the OTA protocol, after checking the device is healthy (see the ota-console
# web app / `espp-ota` CLI, which confirm it on reconnect).
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
